import { Section } from './section'

export function AboutSection() {
  return (
    <Section id='about' title='About' divider>
      <p>
        我是一名前端工程師。我畢業於淡江大學，並在畢業後加入了長榮國際有限公司。在長榮工作的過程中，我開始對程式設計產生興趣，尤其是前端開發方面。在經過三年的服務後，我於2020年1月成功實現了一個轉職的夢想，成為了一名全職前端工程師。
      </p >
      <p>
        目前，我擁有近4年的工作經驗，並且擔任著資深前端工程師的職位，這段時間我一直在一家名為點單（Dimorder）的公司工作。我最喜歡程式設計的部分是解決問題的過程。我喜愛那種終於找到解決方案的感覺，它讓我充滿滿足感。
      </p>
      <p>
        我的程式語言技能包括使用Typescript來編寫程式碼。我主要負責React前端專案的開發，這包括點餐前端、營運後台、店家後台、營運報表等四個應用程式。此外，我也參與了React Native前端專案的開發，包括POS機、外送員App、店家金流App等三款應用程式。我還會使用Next.js，並且持續學習其他前端框架，我總是渴望學習新的技術。
      </p>
      <p>
        除了前端開發，我還曾經撰寫過Node.js/Express後端伺服器並且有串接第三方API的經驗。目前，我正在積極尋找一個全職的軟體開發職位，因為我對不斷學習和挑戰自己充滿熱情。我期待著能夠為一家優秀的軟體開發團隊做出貢獻。
      </p>
    </Section >
  )
}